Revit 2027 API
BuiltInFailures.MEPCalculationFailures.NetworkErrorModelTooBig Property
 The size of the network exceeds the current limit for flow/pressure analysis. In the Mechanical Settings dialog, under Pipe Settings - Calculation, disable the option to Use analysis for closed loop hydronic networks.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NetworkErrorModelTooBig { get; }
Public Shared ReadOnly Property NetworkErrorModelTooBig As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NetworkErrorModelTooBig {
	FailureDefinitionId^ get ();
}
static member NetworkErrorModelTooBig : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace